; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v5)
             (pred_9 ?v10 ?v6)
             (pred_12 ?v3 ?v6)
             (pred_11 ?v2 ?v3 )
	     (pred_7 ?v3)
             (pred_2 ?v1)
             (pred_1 ?v10)
             (pred_6 ?v6)
             (pred_3 ?v3)
             (pred_5 ?v10)
             (pred_10 ?v3)
             (pred_4 ))



(:action op_3
:parameters (?v13 ?v11 ?v7 ?v9)
:precondition (and (pred_2 ?v13) (pred_2 ?v11) (pred_1 ?v7) (pred_6 ?v9)
          (pred_8 ?v13 ?v11) (pred_9 ?v7 ?v9)
                   (pred_12 ?v11 ?v9) (pred_7 ?v13) 
                   (pred_3 ?v11) (pred_5 ?v7))
:effect (and  (pred_10 ?v11) (not (pred_3 ?v11))))


(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_2 ?v13) (pred_2 ?v12)
               (pred_7 ?v13) (pred_8 ?v13 ?v12) (pred_10 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v13))))

(:action op_2
:parameters (?v13 ?v7)
:precondition (and (pred_2 ?v13) (pred_1 ?v7) 
                  (pred_7 ?v13) (pred_11 ?v7 ?v13) (pred_4 ))
:effect (and (pred_5 ?v7)
   (not (pred_11 ?v7 ?v13)) (not (pred_4 ))))


(:action op_5
:parameters (?v13 ?v4 ?v8)
:precondition (and (pred_2 ?v13) (pred_1 ?v4) (pred_1 ?v8)
                  (pred_7 ?v13) (pred_5 ?v8) (pred_11 ?v4 ?v13))
:effect (and (pred_5 ?v4) (pred_11 ?v8 ?v13)
        (not (pred_5 ?v8)) (not (pred_11 ?v4 ?v13))))

(:action op_4
:parameters (?v13 ?v7)
:precondition (and (pred_2 ?v13) (pred_1 ?v7) 
                  (pred_7 ?v13) (pred_5 ?v7))
:effect (and (pred_4 ) (pred_11 ?v7 ?v13) (not (pred_5 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_15 obj_11 obj_13 obj_09 obj_20 obj_12 obj_03 obj_04 obj_18 obj_16 obj_10 obj_14 obj_07 obj_17 obj_02
    obj_08 obj_01
    obj_19 obj_05
    )

    (:init
       (pred_4)

       (pred_2 obj_06)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_13)
       (pred_2 obj_09)
       (pred_2 obj_20)
       (pred_2 obj_12)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_18)
       (pred_2 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_14)
       (pred_2 obj_07)
       (pred_2 obj_17)
       (pred_2 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_05)

       (pred_8 obj_06 obj_09)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_13)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_11)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_06)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_03 obj_10)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_03)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_17)
       (pred_3 obj_13)
       (pred_3 obj_15)
       (pred_12  obj_13 obj_08)
       (pred_12  obj_15 obj_01)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_18)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_14)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_02)

       (pred_9  obj_19 obj_08)
       (pred_9  obj_05 obj_01)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_05 obj_07)
       (pred_7 obj_16)
    )

    (:goal (and
       (pred_11 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_18)))
)
)

; plan
1. (op_1 obj_16 obj_17)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_17)
   goals met: 0 of 1
2. (op_1 obj_17 obj_07)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_07)
   goals met: 0 of 1
3. (op_2 obj_07 obj_05)
   deleted: (pred_11 obj_05 obj_07) (pred_4)
   added: (pred_5 obj_05)
   goals met: 0 of 1
4. (op_1 obj_07 obj_17)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_17)
   goals met: 0 of 1
5. (op_1 obj_17 obj_16)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_16)
   goals met: 0 of 1
6. (op_1 obj_16 obj_12)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_12)
   goals met: 0 of 1
7. (op_1 obj_12 obj_11)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_05)
   deleted: (pred_5 obj_05)
   added: (pred_4) (pred_11 obj_05 obj_11)
   goals met: 1 of 1
